import pytest

from rus.wfst import normalize


@pytest.mark.parametrize(
    "spoken,expected",
    [
        ("один", "один"),
        ("минус один", "минус один"),
        ("девять", "девять"),
        ("сорок один", "41"),
        ("минус тринадцать", "-13"),
        ("тринадцать", "13"),
        ("четырнадцать", "14"),
        ("сто четырнадцать", "114"),
        ("ста четырнадцать", "114"),
        ("сто сорок один", "141"),
        ("сто", "100"),
        ("двести один", "201"),
        ("пятьсот десять", "510"),
        ("одна тысяча сто один", "1101"),
        ("двадцать две тысячи", "22000"),
        ("двадцать пять тысяч", "25000"),
        ("двадцать две тысячи сто один", "22101"),
        ("двадцать две тысячи сто один", "22101"),
        ("две тысячи двадцать два", "2022"),
        ("две тысячи два", "2002"),
        ("десять тысячи два", "10002"),
        ("двести двадцать", "220"),
        ("тысячу двести двадцать", "1220"),
        ("тысяча девятьсот семьдесят", "1970"),
        ("одна тысяча девятьсот семьдесят", "1970"),
        ("одна тысяча девятьсот семьдесят", "1970"),
    ],
)
def test_cardinal(spoken, expected):
    assert normalize(spoken) == expected
