import pytest

from rus.wfst import normalize


@pytest.mark.parametrize(
    "spoken,expected",
    [
        ("седьмой час двадцать пять минут", "07:25"),
        ("седьмой час пять минут", "07:05"),
        ("двенадцатый час пять минут", "12:05"),
        ("половина десятого", "09:30"),
        ("половина первого", "00:30"),
        ("половина третьего", "02:30"),
        ("половина двадцать четвертого", "23:30"),
        ("четверть одиннадцатого", "10:15"),
        ("без четверти одиннадцатая", "10:45"),
        ("пять минут двенадцатого", "11:05"),
        ("сорок семь минут двадцать второго", "21:47"),
        ("двенадцатый ноль ноль", "12:00"),
        ("двенадцатый час ноль ноль", "12:00"),
        ("одиннадцатый ноль шесть", "11:06"),
        ("шестой сорок три", "06:43"),
    ],
)
def test_time(spoken, expected):
    assert normalize(spoken) == expected
